Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags
Boolean flags for IFC 2x3 export.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExcludeSinglePartAssemblies
Boolean indicating whether single part assemblies are excluded.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportAllObjects
Boolean indicating whether to export all objects.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportSelectedObjectsAndTheirAssemblies
Boolean indicating whether to export selected objects and their assemblies.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportBrepAsExactSolid
Boolean indicating whether BREP is exported as exact solid.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportBuildingHierarchy
Boolean indicating whether the building hierarchy export is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportFlatBeamsAsPlates
Boolean indicating whether flat beams are exported as plates.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportLocationsFromOrganizer
Boolean indicating whether locations are obtained from the organizer.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.ExportPolyBeamAsSectionedSpine
Boolean indicating whether polybeams are exported as sectioned spines.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IncludeAssemblyHiearachy
Boolean indicating whether the assembly hierarhcy (IFCELEMENTASSEMBLY) is exported.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsBoltsEnabled
Boolean indicating whether the bolts export is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsGridsEnabled
Boolean indicating whether the grids export is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsPoursEnabled
Pours export is enabled. True for pours, false for CIP cast-units and/or parts

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsRebarsEnabled
Boolean indicating whether the rebars export is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsSpacesEnabled
Boolean indicating whether the export of spaces in building hierarchy is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsSurfaceTreatmentsAndSurfacesEnabled
Boolean indicating whether the surfaces and surface treatments export is enabled.

Tekla.Structures.Model.Operations.Operation.IFC2x3ExportFlags.IsWeldsEnabled
Boolean indicating whether the welds export is enabled.